Repository: xcession/sphinx-archlinux
Catalog: locale/*/LC_MESSAGES/arch_linux/installation/index.po
Languages: th_th

source: Installation
th_th: การติดตั้ง

source: The ``#`` symbol in the shell prompt, indicate that you are execute commands as *root* user. While ``$`` symbol indicate that you are execute commands as *normal* user.
th_th: สัญลักษณ์ ``#`` ที่ shell prompt บ่งบอกว่าคุณกำลังใช้คำสั่ง เป็นผู้ใช้ *root* ในขณะที่สัญลักษณ์ ``$`` บอกว่าคุณกำลังใช้คำสั่ง เป็นผู้ใช้ *ทั่วไป*

source: Preparing
th_th: เตรียมพร้อม

source: Verify Internet Connection
th_th: ยืนยันการเชื่อมต่ออินเตอร์เนต

source: Verify internet connection with the ``ping`` command:
th_th: ยืนยันการเชื่อมต่ออินเตอร์เนตด้วยคำสั่ง ``ping``:

source: In live session, you can connect to Wi-Fi using the ``iwctl`` command.
th_th: ใน live เซสชั่น คุณสามารถเชื่อมต่อ WiFi ด้วยคำสั่ง ``iwctl``

source: To get an interactive prompt:
th_th: เข้า prompt แบบ interactive:

source: In the ``iwctl`` prompt you can auto-complete commands and device names by pressing ``Tab``.
th_th: ที่ prompt ของ ``iwctl`` คุณสามารถที่จะ auto-complete คำสั่งต่างๆ หรือ ชื่อของอุปกรณ์ ได้โดยการกดปุ่ม ``Tab``

source: To exit the interactive prompt, send EOF by pressing ``Ctrl+d``.
th_th: คุณสามารถออกจาก interactive prompt ได้ด้วยการกดปุ่ม ``Ctrl+d``

source: You can use all commands as command line arguments without entering an interactive prompt. For example: ``iwctl device wlan0 show``.
th_th: คุณสามารถใช้คำสั่งทั้งหมดในรูปแบบของ command line arguments โดยไม่จำเป็นที่จะต้องเข้า interactive prompt, ตัวอย่างเช่น: ``iwctl device wlan0 show``

source: To list all available commands:
th_th: แสดงคำสั่งที่มีทั้งหมด:

source: Connect to a network
th_th: การเชื่อมต่อเครือข่าย

source: List all Wi-Fi devices:
th_th: แสดงอุปกรณ์ Wi-Fi ทั้งหมด:

source: Scan for networks:
th_th: สแกนหาเครือข่าย:

source: List all available networks:
th_th: แสดงเครือข่ายทั้งหมดที่พบ:

source: Connect to a network:
th_th: เชื่อมต่อกับเครือข่าย:

source: If a passphrase is required, you will prompt to enter it. Alternatively, you can supply it as a command line argument:
th_th: หากเครือข่ายนั้นมีการเข้ารหัส คุณจะถูกแจ้งให้ใส่รหัสผ่าน นอกจากนั้น คุณยังสามารถระบุรหัสผ่านในรูปแบบของ command line argument ก็ได้เช่นกัน:

source: Set Keyboard Layout
th_th: การตั้งค่าคีย์บอร์ดเลย์เอาท์

source: List available keyboard layouts:
th_th: แสดงคีย์บอร์ดเลย์เอาท์ทั้งหมด:

source: To set keyboard layout:
th_th: ตั้งค่าคีย์บอร์ดเลย์เอาท์:

source: The default console keymap is ``us``
th_th: ``us`` เป็นค่าเริ่มต้นของคีย์บอร์ดเลย์เอาท์

source: Verify the current Boot Mode
th_th: ยืนยันโหมดบูตปัจจุบัน

source: To verify the current boot mode, list the *efivars* directory:
th_th: สามารถยืนยันโหมดบูตปัจจุบัน ได้โดยตรวจสอบไดเรกทอรี่ *efivars*:

source: If the command shows the directory without error, then the system is booted in **UEFI** mode. If the directory does not exist, the system maybe booted in **BIOS** (or **Legacy**) mode.
th_th: ถ้าคำสั่งแสดงไดเรกทอรี่ได้โดยไม่แสดงข้อผิดพลาด หมายความว่าระบบถูกบูต ในโหมด **UEFI**, ถ้าไม่พบไดเรกทอรี่ หมายความว่าระบบถูกบูต ในโหมด **BIOS** (หรือ **Legacy**)

source: Update the System Clock
th_th: การอัพเดทนาฬิการะบบ

source: To ensure the system clock is accurate:
th_th: เพื่อให้แน่ใจว่านาฬิการะบบนั้นถูกต้อง:

source: To check the service status, use ``timedatectl status``.
th_th: สามารถตรวจสอบสถานะปัจจุบัน ด้วยคำสั่ง ``timedatectl status``

source: Partition the Disk
th_th: การจัดการดิสก์พาร์ทิชัน

source: List All Available Storage Devices
th_th: การแสดงรายการของอุปกรณ์เก็บข้อมูล

source: To list all available storage devices by use ``fdisk`` or ``lsblk`` command.
th_th: สามารถแสดงรายการอุปกรณ์เก็บข้อมูลทั้งหมด ได้ด้วยคำสั่ง ``fdisk`` หรือ ``lsblk``

source: List all available storage devices using the ``fdisk`` command:
th_th: แสดงรายการอุปกรณ์เก็บข้อมูลทั้งหมด โดยใช้คำสั่ง ``fdisk``:

source: List all available storage devices using the ``lsblk`` command:
th_th: แสดงรายการอุปกรณ์เก็บข้อมูลทั้งหมด โดยใช้คำสั่ง ``lsblk``:

source: Create Partition Table
th_th: การสร้างพาร์ทิชันเทเบิ้ล

source: This will wipe everything!
th_th: ข้อมูลทุกอย่างจะถูกลบ!

source: Partion the disk using ``fdisk`` command:
th_th: จัดการพาร์ทิชัน โดยใช้คำสั่ง ``fdisk``:

source: Partition the disk using ``cfdisk`` command:
th_th: จัดการพาร์ทิชัน โดยใช้คำสั่ง ``cfdisk``:

source: Disk Format and Mount Filesystem
th_th: การฟอร์แมตดิสก์ และการ Mount ระบบไฟล์

source: Format the Partitions
th_th: การฟอร์แมตพาร์ทิชัน

source: Swap Partition
th_th: พาร์ทิชัน Swap

source: Format swap partition:
th_th: ฟอร์แมตพาร์ทิชัน Swap:

source: Boot Partition
th_th: พาร์ทิชัน Boot

source: For **Legacy systems** (**EXT2** filesystem):
th_th: สำหรับระบบ **Legacy** (ระบบไฟล์ **EXT2**):

source: For **UEFI systems** (**FAT32** filesystem):
th_th: สำหรับระบบ **UEFI** (ระบบไฟล์ **FAT32**):

source: Boot partition on the UEFI system has to be **FAT32**.
th_th: พาร์ทิชัน Boot บนระบบ UEFI จำเป็นต้องฟอร์แมตเป็น **FAT32**

source: Root Partition
th_th: พาร์ทิชัน Root

source: Format root partition (**EXT4** filesystem):
th_th: ฟอร์แมตพาร์ทิชัน Root (ระบบไฟล์ **EXT4**):

source: Home Partition
th_th: พาร์ทิชัน Home

source: Format home partition (**EXT4** filesystem):
th_th: ฟอร์แมตพาร์ทิชัน Home (ระบบไฟล์ **EXT4**):

source: Mount the Filesystem
th_th: การ Mount ระบบไฟล์

source: Mount swap partition:
th_th: Mount พาร์ทิชัน Swap:

source: Mount root partition:
th_th: Mount พาร์ทิชัน Root:

source: Create boot directory and mount boot partition:
th_th: สร้างไดเรกทอรี่ boot และ Mount พาร์ทิชัน Boot:

source: Create home directory and mount home partition:
th_th: สร้างไดเรกทอรี่ home และ Mount พาร์ทิชัน Home:

source: Installing
th_th: การติดตั้ง

source: Install the Base Packages
th_th: การติดตั้งแพ็กเกจพื้นฐาน

source: Install base packages and developer tools:
th_th: ติดตั้งแพ็กเกจพื้นฐาน และเครื่องมือนักพัฒนาพื้นฐาน:

source: Install a Kernel
th_th: ติดตั้งเคอร์เนล

source: Install Vim
th_th: ติดตั้ง Vim

source: Configure the System
th_th: การตั้งค่าระบบ

source: Time Zone
th_th: เขตเวลา

source: Set the time zone:
th_th: ตั้งค่าเขตเวลา:

source: Run ``hwclock`` to generate ``/etc/adjtime``:
th_th: เรียกใช้คำสั่ง ``hwclock`` เพื่อสร้างไฟล์ ``/etc/adjtime``:

source: Edit ``/etc/locale.gen`` and uncomment ``en_US.UTF-8``, ``UTF-8`` and other needed locales:
th_th: แก้ไขไฟล์ ``/etc/locale.gen`` โดยปลด Comment ของ ``en_US.UTF-8``, ``UTF-8`` และ Locale อื่นๆ ที่ต้องการ:

source: Generate locale:
th_th: สร้าง Locale:

source: Create ``/etc/locale.conf``:
th_th: สร้างไฟล์ ``/etc/locale.conf``:

source: And set the ``LANG`` variable:
th_th: และตั้งค่าตัวแปร ``LANG``:

source: Then add the following:
th_th: ใส่ข้อมูลตามข้างล่างนี้:

source: Network Configuration
th_th: การตั้งค่าเครือข่าย

source: Set the *hostname* (computer name) by edit ``/etc/hostname``:
th_th: ตั้ง *hostname* (ชื่อเครื่อง) โดยแก้ไขไฟล์ ``/etc/hostname``:

source: Then add *hostname*:
th_th: และใส่ *hostname*:

source: Edit the *hosts* file:
th_th: แก้ไขไฟล์ *hosts*:

source: Make sure ``myhostname`` is the same name that specified in ``/etc/hostname``.
th_th: ให้แน่ใจว่า ``myhostname`` นั้นตรงกับที่ระบุไว้ในไฟล์ ``/etc/hostname``

source: Install NetworkManager:
th_th: ติดตั้ง NetworkManager:

source: Enable the NetworkManager system service:
th_th: เปิดใช้งานเซอร์วิส NetworkManager:

source: Install the DHCP client:
th_th: ติดตั้ง DHCP client:

source: Enable the DHCP client system service:
th_th: เปิดใช้งานเซอร์วิส DHCP client

source: Creating a new initramfs usually not required, because ``mkinitcpio`` was run on installation of the kernel package with ``basestrap``.
th_th: การสร้าง initramfs ใหม่นี้ โดยปกติแล้วไม่จำเป็น เพราะคำสั่ง ``mkinitcpio`` จะถูก เรียกใช้หลังจากการติดตั้งแพ็จเกจเคอร์เนล โดยคำสั่ง ``basestrap``

source: To re-create the initramfs image:
th_th: หากต้องการสร้างอิมเมจของ initramfs อีกครั้ง:

source: Install the Bootloader (GRUB)
th_th: การติดตั้ง Bootloader (GRUB)

source: For Legacy Systems
th_th: สำหรับระบบ Legacy

source: Install ``grub``:
th_th: ติดตั้ง ``grub``:

source: Install bootloader:
th_th: ติดตั้ง bootloader:

source: Generate ``grub`` config file:
th_th: สร้างไฟล์คอนฟิกของ ``grub``:

source: For UEFI Systems
th_th: สำหรับระบบ UEFI

source: Set the Root Password
th_th: การตั้งรหัสผ่าน Root

source: To set root password:
th_th: ตั้งรหัสผ่าน Root:

source: Create a New User
th_th: การสร้างผู้ใช้ใหม่

source: To create a new user:
th_th: สร้างผู้ใช้ใหม่:

source: Set password of the new user:
th_th: ตั้งรหัสผ่านสำหรับผู้ใช้ใหม่:

source: Add new user group(s):
th_th: เพิ่มกลุ่มให้ผู้ใช้ใหม่:

source: To verify user's group(s):
th_th: ยืนยันกลุ่มผู้ใช้:

source: Replace ``<newuser>`` with your user name.
th_th: แทนที่ ``<newuser>`` ด้วยชื่อผู้ใช้ของคุณ

source: Install sudo
th_th: ติดตั้ง sudo

source: Enable *wheel* group for ``sudo``:
th_th: เปิดใช้กลุ่มผู้ใช้ *wheel* สำหรับ ``sudo``:

source: Uncomment the following line:
th_th: ปลด Comment บรรทัดต่อไปนี้:

source: In order to execute the ``visudo`` command, make sure ``vi`` is installed.
th_th: ในการที่จะเรียกใช้คำสั่ง ``visudo`` ได้นั้น จำเป็นที่จะต้องติดตั้ง ``vi`` ด้วย

source: Reboot
th_th: เริ่มระบบใหม่

source: Exit the ``chroot`` environment:
th_th: ออกจาก ``chroot``:

source: Restart the machine:
th_th: เริ่มระบบใหม่:
